{"keras_version": "1.2.0", "class_name": "Model", "config": {"input_layers": [["input_2", 0, 0]], "output_layers": [["dense_8", 0, 0]], "name": "model_2", "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_2", "config": {"batch_input_shape": [2, 5, 50, 160, 3], "sparse": false, "name": "input_2", "input_dtype": "float32"}}, {"inbound_nodes": [[["input_2", 0, 0]]], "class_name": "TimeDistributed", "name": "timedistributed_1", "config": {"trainable": true, "name": "timedistributed_1", "layer": {"class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["merge_1", 0, 0]], "name": "model_1", "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 50, 160, 3], "sparse": false, "name": "input_1", "input_dtype": "float32"}}, {"inbound_nodes": [[["input_1", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_1", "config": {"activation": "relu", "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "name": "convolution2d_1", "bias": true, "nb_filter": 32, "init": "he_uniform", "trainable": true, "nb_col": 3, "nb_row": 3, "border_mode": "same", "subsample": [1, 1], "W_regularizer": null, "dim_ordering": "tf", "b_constraint": null}}, {"inbound_nodes": [[["convolution2d_1", 0, 0]]], "class_name": "MaxPooling2D", "name": "maxpooling2d_1", "config": {"pool_size": [2, 2], "trainable": true, "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_1", "dim_ordering": "tf"}}, {"inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "class_name": "Dropout", "name": "dropout_1", "config": {"trainable": true, "name": "dropout_1", "p": 0.3}}, {"inbound_nodes": [[["dropout_1", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_2", "config": {"activation": "relu", "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "name": "convolution2d_2", "bias": true, "nb_filter": 64, "init": "he_uniform", "trainable": true, "nb_col": 3, "nb_row": 3, "border_mode": "same", "subsample": [1, 1], "W_regularizer": null, "dim_ordering": "tf", "b_constraint": null}}, {"inbound_nodes": [[["convolution2d_2", 0, 0]]], "class_name": "MaxPooling2D", "name": "maxpooling2d_2", "config": {"pool_size": [2, 2], "trainable": true, "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_2", "dim_ordering": "tf"}}, {"inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "class_name": "Dropout", "name": "dropout_2", "config": {"trainable": true, "name": "dropout_2", "p": 0.3}}, {"inbound_nodes": [[["dropout_2", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_3", "config": {"activation": "relu", "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "name": "convolution2d_3", "bias": true, "nb_filter": 128, "init": "he_uniform", "trainable": true, "nb_col": 3, "nb_row": 3, "border_mode": "same", "subsample": [1, 1], "W_regularizer": null, "dim_ordering": "tf", "b_constraint": null}}, {"inbound_nodes": [[["convolution2d_3", 0, 0]]], "class_name": "MaxPooling2D", "name": "maxpooling2d_3", "config": {"pool_size": [2, 2], "trainable": true, "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_3", "dim_ordering": "tf"}}, {"inbound_nodes": [[["maxpooling2d_3", 0, 0]]], "class_name": "Dropout", "name": "dropout_3", "config": {"trainable": true, "name": "dropout_3", "p": 0.3}}, {"inbound_nodes": [[["dropout_3", 0, 0]]], "class_name": "Flatten", "name": "flatten_3", "config": {"trainable": true, "name": "flatten_3"}}, {"inbound_nodes": [[["flatten_3", 0, 0]]], "class_name": "Dense", "name": "dense_4", "config": {"activation": "relu", "b_regularizer": null, "output_dim": 1024, "input_dim": 15360, "name": "dense_4", "bias": true, "init": "he_uniform", "trainable": true, "W_constraint": null, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["dense_4", 0, 0]]], "class_name": "Dropout", "name": "dropout_4", "config": {"trainable": true, "name": "dropout_4", "p": 0.3}}, {"inbound_nodes": [[["dropout_4", 0, 0]]], "class_name": "Dense", "name": "dense_5", "config": {"activation": "relu", "b_regularizer": null, "output_dim": 256, "input_dim": 1024, "name": "dense_5", "bias": true, "init": "he_uniform", "trainable": true, "W_constraint": null, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["dropout_1", 0, 0]]], "class_name": "Flatten", "name": "flatten_1", "config": {"trainable": true, "name": "flatten_1"}}, {"inbound_nodes": [[["dropout_2", 0, 0]]], "class_name": "Flatten", "name": "flatten_2", "config": {"trainable": true, "name": "flatten_2"}}, {"inbound_nodes": [[["dense_5", 0, 0]]], "class_name": "Dropout", "name": "dropout_5", "config": {"trainable": true, "name": "dropout_5", "p": 0.3}}, {"inbound_nodes": [[["flatten_1", 0, 0]]], "class_name": "Dense", "name": "dense_1", "config": {"activation": "linear", "b_regularizer": null, "output_dim": 256, "input_dim": 64000, "name": "dense_1", "bias": true, "init": "glorot_uniform", "trainable": true, "W_constraint": null, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["flatten_2", 0, 0]]], "class_name": "Dense", "name": "dense_2", "config": {"activation": "linear", "b_regularizer": null, "output_dim": 256, "input_dim": 30720, "name": "dense_2", "bias": true, "init": "glorot_uniform", "trainable": true, "W_constraint": null, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["flatten_3", 0, 0]]], "class_name": "Dense", "name": "dense_3", "config": {"activation": "linear", "b_regularizer": null, "output_dim": 256, "input_dim": 15360, "name": "dense_3", "bias": true, "init": "glorot_uniform", "trainable": true, "W_constraint": null, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["dropout_5", 0, 0], ["dense_1", 0, 0], ["dense_2", 0, 0], ["dense_3", 0, 0]]], "class_name": "Merge", "name": "merge_1", "config": {"mode": "sum", "arguments": {}, "concat_axis": -1, "mode_type": "raw", "output_shape": null, "output_shape_type": "raw", "output_mask_type": "raw", "name": "merge_1", "output_mask": null, "dot_axes": -1}}]}}}}, {"inbound_nodes": [[["timedistributed_1", 0, 0]]], "class_name": "GRU", "name": "gru_1", "config": {"activation": "tanh", "b_regularizer": null, "return_sequences": true, "output_dim": 32, "consume_less": "cpu", "batch_input_shape": [2, 5, 256], "name": "gru_1", "stateful": true, "dropout_W": 0.0, "init": "glorot_uniform", "trainable": true, "dropout_U": 0.0, "U_regularizer": null, "unroll": false, "W_regularizer": null, "go_backwards": false, "inner_activation": "hard_sigmoid", "inner_init": "orthogonal"}}, {"inbound_nodes": [[["gru_1", 0, 0]]], "class_name": "GRU", "name": "gru_2", "config": {"activation": "tanh", "b_regularizer": null, "return_sequences": false, "output_dim": 32, "consume_less": "cpu", "batch_input_shape": [2, 5, 32], "name": "gru_2", "stateful": true, "dropout_W": 0.0, "init": "glorot_uniform", "trainable": true, "dropout_U": 0.0, "U_regularizer": null, "unroll": false, "W_regularizer": null, "go_backwards": false, "inner_activation": "hard_sigmoid", "inner_init": "orthogonal"}}, {"inbound_nodes": [[["gru_2", 0, 0]]], "class_name": "Dense", "name": "dense_6", "config": {"activation": "relu", "b_regularizer": null, "output_dim": 128, "input_dim": 32, "W_constraint": null, "name": "dense_6", "bias": true, "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["dense_6", 0, 0]]], "class_name": "Dense", "name": "dense_7", "config": {"activation": "linear", "b_regularizer": null, "output_dim": 0.3, "input_dim": 128, "W_constraint": null, "name": "dense_7", "bias": true, "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["dense_7", 0, 0]]], "class_name": "Dense", "name": "dense_8", "config": {"activation": "linear", "b_regularizer": null, "output_dim": 2, "input_dim": 0.3, "W_constraint": null, "name": "dense_8", "bias": true, "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null}}]}}