{"config": {"name": "model_1", "layers": [{"inbound_nodes": [], "name": "input_1", "config": {"batch_input_shape": [null, 80, 320, 3], "sparse": false, "name": "input_1", "input_dtype": "float32"}, "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0]]], "name": "lambda_1", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0005imager\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa4/home/dat/Documents/behavioral-cloning/prediction.py\u00da\b<lambda>]\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "name": "lambda_1", "arguments": {}, "trainable": true, "output_shape": null, "batch_input_shape": [null, 80, 320, 3], "output_shape_type": "raw", "input_dtype": "float32"}, "class_name": "Lambda"}, {"inbound_nodes": [[["lambda_1", 0, 0]]], "name": "convolution2d_1", "config": {"W_constraint": null, "name": "convolution2d_1", "border_mode": "same", "trainable": true, "W_regularizer": null, "nb_filter": 16, "subsample": [1, 1], "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "tf", "init": "he_uniform", "nb_row": 3, "b_constraint": null, "activation": "relu", "bias": true, "nb_col": 3}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_1", 0, 0]]], "name": "maxpooling2d_1", "config": {"name": "maxpooling2d_1", "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "name": "dropout_1", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_1", 0, 0]]], "name": "convolution2d_2", "config": {"W_constraint": null, "name": "convolution2d_2", "border_mode": "same", "trainable": true, "W_regularizer": null, "nb_filter": 32, "subsample": [1, 1], "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "tf", "init": "he_uniform", "nb_row": 3, "b_constraint": null, "activation": "relu", "bias": true, "nb_col": 3}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_2", 0, 0]]], "name": "maxpooling2d_2", "config": {"name": "maxpooling2d_2", "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "name": "dropout_2", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_2", 0, 0]]], "name": "convolution2d_3", "config": {"W_constraint": null, "name": "convolution2d_3", "border_mode": "same", "trainable": true, "W_regularizer": null, "nb_filter": 64, "subsample": [1, 1], "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "tf", "init": "he_uniform", "nb_row": 3, "b_constraint": null, "activation": "relu", "bias": true, "nb_col": 3}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_3", 0, 0]]], "name": "maxpooling2d_3", "config": {"name": "maxpooling2d_3", "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["maxpooling2d_3", 0, 0]]], "name": "dropout_3", "config": {"name": "dropout_3", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_3", 0, 0]]], "name": "flatten_1", "config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"inbound_nodes": [[["flatten_1", 0, 0]]], "name": "dense_1", "config": {"W_constraint": null, "name": "dense_1", "trainable": true, "W_regularizer": null, "activation": "relu", "b_regularizer": null, "input_dim": 25600, "output_dim": 512, "init": "he_uniform", "b_constraint": null, "bias": true, "activity_regularizer": null}, "class_name": "Dense"}, {"inbound_nodes": [[["dense_1", 0, 0]]], "name": "dropout_4", "config": {"name": "dropout_4", "p": 0.3, "trainable": true}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_4", 0, 0]]], "name": "dense_2", "config": {"W_constraint": null, "name": "dense_2", "trainable": true, "W_regularizer": null, "activation": "relu", "b_regularizer": null, "input_dim": 512, "output_dim": 256, "init": "he_uniform", "b_constraint": null, "bias": true, "activity_regularizer": null}, "class_name": "Dense"}, {"inbound_nodes": [[["dense_2", 0, 0]]], "name": "dense_3", "config": {"W_constraint": null, "name": "dense_3", "trainable": true, "W_regularizer": null, "activation": "linear", "b_regularizer": null, "input_dim": 256, "output_dim": 1, "init": "glorot_uniform", "b_constraint": null, "bias": true, "activity_regularizer": null}, "class_name": "Dense"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_3", 0, 0]]}, "class_name": "Model", "keras_version": "1.2.0"}