{"keras_version": "1.2.0", "class_name": "Model", "config": {"layers": [{"name": "cifar", "inbound_nodes": [], "config": {"input_dtype": "float32", "batch_input_shape": [null, 80, 160, 3], "sparse": false, "name": "cifar"}, "class_name": "InputLayer"}, {"name": "lambda_1", "inbound_nodes": [[["cifar", 0, 0]]], "config": {"output_shape": null, "function_type": "lambda", "name": "lambda_1", "batch_input_shape": [null, 80, 160, 3], "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0005imager\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa0/home/dat/Documents/behavioral-cloning/resnet.py\u00da\b<lambda>g\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "input_dtype": "float32", "trainable": true}, "class_name": "Lambda"}, {"name": "cropping2d_1", "inbound_nodes": [[["lambda_1", 0, 0]]], "config": {"trainable": true, "name": "cropping2d_1", "cropping": [[30, 5], [1, 1]]}, "class_name": "Cropping2D"}, {"name": "conv0", "inbound_nodes": [[["cropping2d_1", 0, 0]]], "config": {"dim_ordering": "tf", "b_regularizer": null, "W_constraint": null, "nb_row": 5, "trainable": true, "activity_regularizer": null, "W_regularizer": {"l1": 0.0, "l2": 0.0, "name": "L1L2Regularizer"}, "border_mode": "same", "activation": "linear", "name": "conv0", "nb_col": 5, "bias": false, "b_constraint": null, "nb_filter": 32, "init": "glorot_normal", "subsample": [2, 2]}, "class_name": "Convolution2D"}, {"name": "bn0", "inbound_nodes": [[["conv0", 0, 0]]], "config": {"beta_regularizer": null, "epsilon": 0.001, "axis": 1, "name": "bn0", "gamma_regularizer": null, "mode": 0, "momentum": 0.99, "trainable": true}, "class_name": "BatchNormalization"}, {"name": "relu0", "inbound_nodes": [[["bn0", 0, 0]]], "config": {"activation": "relu", "trainable": true, "name": "relu0"}, "class_name": "Activation"}, {"name": "conv1a", "inbound_nodes": [[["relu0", 0, 0]]], "config": {"dim_ordering": "tf", "b_regularizer": null, "W_constraint": null, "nb_row": 1, "trainable": true, "activity_regularizer": null, "W_regularizer": {"l1": 0.0, "l2": 0.0, "name": "L1L2Regularizer"}, "border_mode": "valid", "activation": "linear", "name": "conv1a", "nb_col": 1, "bias": false, "b_constraint": null, "nb_filter": 16, "init": "glorot_normal", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"name": "bn1b", "inbound_nodes": [[["conv1a", 0, 0]]], "config": {"beta_regularizer": null, "epsilon": 0.001, "axis": 1, "name": "bn1b", "gamma_regularizer": null, "mode": 0, "momentum": 0.99, "trainable": true}, "class_name": "BatchNormalization"}, {"name": "relu1b", "inbound_nodes": [[["bn1b", 0, 0]]], "config": {"activation": "relu", "trainable": true, "name": "relu1b"}, "class_name": "Activation"}, {"name": "conv1b", "inbound_nodes": [[["relu1b", 0, 0]]], "config": {"dim_ordering": "tf", "b_regularizer": null, "W_constraint": null, "nb_row": 3, "trainable": true, "activity_regularizer": null, "W_regularizer": {"l1": 0.0, "l2": 0.0, "name": "L1L2Regularizer"}, "border_mode": "same", "activation": "linear", "name": "conv1b", "nb_col": 3, "bias": false, "b_constraint": null, "nb_filter": 16, "init": "glorot_normal", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"name": "bn1c", "inbound_nodes": [[["conv1b", 0, 0]]], "config": {"beta_regularizer": null, "epsilon": 0.001, "axis": 1, "name": "bn1c", "gamma_regularizer": null, "mode": 0, "momentum": 0.99, "trainable": true}, "class_name": "BatchNormalization"}, {"name": "relu1c", "inbound_nodes": [[["bn1c", 0, 0]]], "config": {"activation": "relu", "trainable": true, "name": "relu1c"}, "class_name": "Activation"}, {"name": "conv1c", "inbound_nodes": [[["relu1c", 0, 0]]], "config": {"dim_ordering": "tf", "b_regularizer": null, "W_constraint": null, "nb_row": 3, "trainable": true, "activity_regularizer": null, "W_regularizer": {"l1": 0.0, "l2": 0.0, "name": "L1L2Regularizer"}, "border_mode": "same", "activation": "linear", "name": "conv1c", "nb_col": 3, "bias": true, "b_constraint": null, "nb_filter": 32, "init": "glorot_normal", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"name": "+1", "inbound_nodes": [[["conv1c", 0, 0], ["relu0", 0, 0]]], "config": {"output_shape_type": "raw", "mode": "sum", "output_mask_type": "raw", "concat_axis": -1, "name": "+1", "dot_axes": -1, "arguments": {}, "output_mask": null, "mode_type": "raw", "output_shape": null}, "class_name": "Merge"}, {"name": "bn2a", "inbound_nodes": [[["+1", 0, 0]]], "config": {"beta_regularizer": null, "epsilon": 0.001, "axis": 1, "name": "bn2a", "gamma_regularizer": null, "mode": 0, "momentum": 0.99, "trainable": true}, "class_name": "BatchNormalization"}, {"name": "relu2a", "inbound_nodes": [[["bn2a", 0, 0]]], "config": {"activation": "relu", "trainable": true, "name": "relu2a"}, "class_name": "Activation"}, {"name": "conv2a", "inbound_nodes": [[["relu2a", 0, 0]]], "config": {"dim_ordering": "tf", "b_regularizer": null, "W_constraint": null, "nb_row": 1, "trainable": true, "activity_regularizer": null, "W_regularizer": {"l1": 0.0, "l2": 0.0, "name": "L1L2Regularizer"}, "border_mode": "valid", "activation": "linear", "name": "conv2a", "nb_col": 1, "bias": false, "b_constraint": null, "nb_filter": 16, "init": "glorot_normal", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"name": "bn2b", "inbound_nodes": [[["conv2a", 0, 0]]], "config": {"beta_regularizer": null, "epsilon": 0.001, "axis": 1, "name": "bn2b", "gamma_regularizer": null, "mode": 0, "momentum": 0.99, "trainable": true}, "class_name": "BatchNormalization"}, {"name": "relu2b", "inbound_nodes": [[["bn2b", 0, 0]]], "config": {"activation": "relu", "trainable": true, "name": "relu2b"}, "class_name": "Activation"}, {"name": "conv2b", "inbound_nodes": [[["relu2b", 0, 0]]], "config": {"dim_ordering": "tf", "b_regularizer": null, "W_constraint": null, "nb_row": 3, "trainable": true, "activity_regularizer": null, "W_regularizer": {"l1": 0.0, "l2": 0.0, "name": "L1L2Regularizer"}, "border_mode": "same", "activation": "linear", "name": "conv2b", "nb_col": 3, "bias": false, "b_constraint": null, "nb_filter": 16, "init": "glorot_normal", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"name": "bn2c", "inbound_nodes": [[["conv2b", 0, 0]]], "config": {"beta_regularizer": null, "epsilon": 0.001, "axis": 1, "name": "bn2c", "gamma_regularizer": null, "mode": 0, "momentum": 0.99, "trainable": true}, "class_name": "BatchNormalization"}, {"name": "relu2c", "inbound_nodes": [[["bn2c", 0, 0]]], "config": {"activation": "relu", "trainable": true, "name": "relu2c"}, "class_name": "Activation"}, {"name": "conv2c", "inbound_nodes": [[["relu2c", 0, 0]]], "config": {"dim_ordering": "tf", "b_regularizer": null, "W_constraint": null, "nb_row": 3, "trainable": true, "activity_regularizer": null, "W_regularizer": {"l1": 0.0, "l2": 0.0, "name": "L1L2Regularizer"}, "border_mode": "same", "activation": "linear", "name": "conv2c", "nb_col": 3, "bias": true, "b_constraint": null, "nb_filter": 32, "init": "glorot_normal", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"name": "+2", "inbound_nodes": [[["conv2c", 0, 0], ["+1", 0, 0]]], "config": {"output_shape_type": "raw", "mode": "sum", "output_mask_type": "raw", "concat_axis": -1, "name": "+2", "dot_axes": -1, "arguments": {}, "output_mask": null, "mode_type": "raw", "output_shape": null}, "class_name": "Merge"}, {"name": "bn3a", "inbound_nodes": [[["+2", 0, 0]]], "config": {"beta_regularizer": null, "epsilon": 0.001, "axis": 1, "name": "bn3a", "gamma_regularizer": null, "mode": 0, "momentum": 0.99, "trainable": true}, "class_name": "BatchNormalization"}, {"name": "relu3a", "inbound_nodes": [[["bn3a", 0, 0]]], "config": {"activation": "relu", "trainable": true, "name": "relu3a"}, "class_name": "Activation"}, {"name": "conv3a", "inbound_nodes": [[["relu3a", 0, 0]]], "config": {"dim_ordering": "tf", "b_regularizer": null, "W_constraint": null, "nb_row": 1, "trainable": true, "activity_regularizer": null, "W_regularizer": {"l1": 0.0, "l2": 0.0, "name": "L1L2Regularizer"}, "border_mode": "valid", "activation": "linear", "name": "conv3a", "nb_col": 1, "bias": false, "b_constraint": null, "nb_filter": 16, "init": "glorot_normal", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"name": "bn3b", "inbound_nodes": [[["conv3a", 0, 0]]], "config": {"beta_regularizer": null, "epsilon": 0.001, "axis": 1, "name": "bn3b", "gamma_regularizer": null, "mode": 0, "momentum": 0.99, "trainable": true}, "class_name": "BatchNormalization"}, {"name": "relu3b", "inbound_nodes": [[["bn3b", 0, 0]]], "config": {"activation": "relu", "trainable": true, "name": "relu3b"}, "class_name": "Activation"}, {"name": "conv3b", "inbound_nodes": [[["relu3b", 0, 0]]], "config": {"dim_ordering": "tf", "b_regularizer": null, "W_constraint": null, "nb_row": 3, "trainable": true, "activity_regularizer": null, "W_regularizer": {"l1": 0.0, "l2": 0.0, "name": "L1L2Regularizer"}, "border_mode": "same", "activation": "linear", "name": "conv3b", "nb_col": 3, "bias": false, "b_constraint": null, "nb_filter": 16, "init": "glorot_normal", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"name": "bn3c", "inbound_nodes": [[["conv3b", 0, 0]]], "config": {"beta_regularizer": null, "epsilon": 0.001, "axis": 1, "name": "bn3c", "gamma_regularizer": null, "mode": 0, "momentum": 0.99, "trainable": true}, "class_name": "BatchNormalization"}, {"name": "relu3c", "inbound_nodes": [[["bn3c", 0, 0]]], "config": {"activation": "relu", "trainable": true, "name": "relu3c"}, "class_name": "Activation"}, {"name": "conv3c", "inbound_nodes": [[["relu3c", 0, 0]]], "config": {"dim_ordering": "tf", "b_regularizer": null, "W_constraint": null, "nb_row": 3, "trainable": true, "activity_regularizer": null, "W_regularizer": {"l1": 0.0, "l2": 0.0, "name": "L1L2Regularizer"}, "border_mode": "same", "activation": "linear", "name": "conv3c", "nb_col": 3, "bias": true, "b_constraint": null, "nb_filter": 32, "init": "glorot_normal", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"name": "+3", "inbound_nodes": [[["conv3c", 0, 0], ["+2", 0, 0]]], "config": {"output_shape_type": "raw", "mode": "sum", "output_mask_type": "raw", "concat_axis": -1, "name": "+3", "dot_axes": -1, "arguments": {}, "output_mask": null, "mode_type": "raw", "output_shape": null}, "class_name": "Merge"}, {"name": "bn4a", "inbound_nodes": [[["+3", 0, 0]]], "config": {"beta_regularizer": null, "epsilon": 0.001, "axis": 1, "name": "bn4a", "gamma_regularizer": null, "mode": 0, "momentum": 0.99, "trainable": true}, "class_name": "BatchNormalization"}, {"name": "relu4a", "inbound_nodes": [[["bn4a", 0, 0]]], "config": {"activation": "relu", "trainable": true, "name": "relu4a"}, "class_name": "Activation"}, {"name": "conv4a", "inbound_nodes": [[["relu4a", 0, 0]]], "config": {"dim_ordering": "tf", "b_regularizer": null, "W_constraint": null, "nb_row": 1, "trainable": true, "activity_regularizer": null, "W_regularizer": {"l1": 0.0, "l2": 0.0, "name": "L1L2Regularizer"}, "border_mode": "valid", "activation": "linear", "name": "conv4a", "nb_col": 1, "bias": false, "b_constraint": null, "nb_filter": 16, "init": "glorot_normal", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"name": "bn4b", "inbound_nodes": [[["conv4a", 0, 0]]], "config": {"beta_regularizer": null, "epsilon": 0.001, "axis": 1, "name": "bn4b", "gamma_regularizer": null, "mode": 0, "momentum": 0.99, "trainable": true}, "class_name": "BatchNormalization"}, {"name": "relu4b", "inbound_nodes": [[["bn4b", 0, 0]]], "config": {"activation": "relu", "trainable": true, "name": "relu4b"}, "class_name": "Activation"}, {"name": "conv4b", "inbound_nodes": [[["relu4b", 0, 0]]], "config": {"dim_ordering": "tf", "b_regularizer": null, "W_constraint": null, "nb_row": 3, "trainable": true, "activity_regularizer": null, "W_regularizer": {"l1": 0.0, "l2": 0.0, "name": "L1L2Regularizer"}, "border_mode": "same", "activation": "linear", "name": "conv4b", "nb_col": 3, "bias": false, "b_constraint": null, "nb_filter": 16, "init": "glorot_normal", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"name": "bn4c", "inbound_nodes": [[["conv4b", 0, 0]]], "config": {"beta_regularizer": null, "epsilon": 0.001, "axis": 1, "name": "bn4c", "gamma_regularizer": null, "mode": 0, "momentum": 0.99, "trainable": true}, "class_name": "BatchNormalization"}, {"name": "relu4c", "inbound_nodes": [[["bn4c", 0, 0]]], "config": {"activation": "relu", "trainable": true, "name": "relu4c"}, "class_name": "Activation"}, {"name": "conv4c", "inbound_nodes": [[["relu4c", 0, 0]]], "config": {"dim_ordering": "tf", "b_regularizer": null, "W_constraint": null, "nb_row": 3, "trainable": true, "activity_regularizer": null, "W_regularizer": {"l1": 0.0, "l2": 0.0, "name": "L1L2Regularizer"}, "border_mode": "same", "activation": "linear", "name": "conv4c", "nb_col": 3, "bias": true, "b_constraint": null, "nb_filter": 32, "init": "glorot_normal", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"name": "+4", "inbound_nodes": [[["conv4c", 0, 0], ["+3", 0, 0]]], "config": {"output_shape_type": "raw", "mode": "sum", "output_mask_type": "raw", "concat_axis": -1, "name": "+4", "dot_axes": -1, "arguments": {}, "output_mask": null, "mode_type": "raw", "output_shape": null}, "class_name": "Merge"}, {"name": "bnF", "inbound_nodes": [[["+4", 0, 0]]], "config": {"beta_regularizer": null, "epsilon": 0.001, "axis": 1, "name": "bnF", "gamma_regularizer": null, "mode": 0, "momentum": 0.99, "trainable": true}, "class_name": "BatchNormalization"}, {"name": "reluF", "inbound_nodes": [[["bnF", 0, 0]]], "config": {"activation": "relu", "trainable": true, "name": "reluF"}, "class_name": "Activation"}, {"name": "avg_pool", "inbound_nodes": [[["reluF", 0, 0]]], "config": {"dim_ordering": "tf", "border_mode": "valid", "pool_size": [22.5, 22.5], "name": "avg_pool", "strides": [22.5, 22.5], "trainable": true}, "class_name": "AveragePooling2D"}, {"name": "flat", "inbound_nodes": [[["avg_pool", 0, 0]]], "config": {"trainable": true, "name": "flat"}, "class_name": "Flatten"}, {"name": "fc1", "inbound_nodes": [[["flat", 0, 0]]], "config": {"activity_regularizer": null, "b_regularizer": null, "output_dim": 1024, "W_constraint": null, "trainable": true, "input_dim": 96.0, "W_regularizer": null, "activation": "relu", "name": "fc1", "bias": true, "b_constraint": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"name": "dropout_1", "inbound_nodes": [[["fc1", 0, 0]]], "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"name": "fc2", "inbound_nodes": [[["dropout_1", 0, 0]]], "config": {"activity_regularizer": null, "b_regularizer": null, "output_dim": 512, "W_constraint": null, "trainable": true, "input_dim": 1024, "W_regularizer": null, "activation": "relu", "name": "fc2", "bias": true, "b_constraint": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"name": "dropout_2", "inbound_nodes": [[["fc2", 0, 0]]], "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"name": "output", "inbound_nodes": [[["dropout_2", 0, 0]]], "config": {"activity_regularizer": null, "b_regularizer": null, "output_dim": 1, "W_constraint": null, "trainable": true, "input_dim": 512, "W_regularizer": null, "activation": "linear", "name": "output", "bias": true, "b_constraint": null, "init": "glorot_uniform"}, "class_name": "Dense"}], "input_layers": [["cifar", 0, 0]], "output_layers": [["output", 0, 0]], "name": "model_1"}}